
#Область ПрограммныйИнтерфейс

// Функция - Получить обработчик
//
// Параметры:
//  КлассСообщения - Строка - описание имени объекта/класса.
// 
// Возвращаемое значение:
//  Структура - Описание обработчика 
//
Функция ПолучитьОбработчик(КлассСообщения) Экспорт 
	
	Если воВходящиеОчередиВызовСервера.DatareonСуществует() Тогда
  		сшпКэшируемыеФункции = воВходящиеОчередиВызовСервера.ОбщийМодуль("сшпКэшируемыеФункции");
		сшпФункциональныеОпции = воВходящиеОчередиВызовСервера.ОбщийМодуль("сшпФункциональныеОпции");
  		СткОбработчик = сшпКэшируемыеФункции.ПолучитьОбработчик(КлассСообщения, Перечисления["сшпТипыИнтеграции"].Входящая, сшпФункциональныеОпции.ВерсияОбработчиков());
	Иначе	
		СткОбработчик = Неопределено;
	КонецЕсли;
	
	Возврат СткОбработчик;
	
КонецФункции

// Функция - Обработчик отключен
//
// Параметры:
//  Обработчик - значение возвращаемое функцией ПолучитьОбработчик
//
// Возвращаемое значение:
//  Булево - отключен обработчик или нет
//
Функция ОбработчикОтключен(Обработчик) Экспорт 
	
	Если воВходящиеОчередиВызовСервера.DatareonСуществует() Тогда
		
		Возврат Обработчик.Статус = Перечисления["сшпСтатусыОбработчиков"].Отключен
		
	Иначе	
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции
#КонецОбласти
