#Область ПрограммныйИнтерфейс

// Функция - Получить список рабочих статусов
//
// Возвращаемое значение:
//  Массив - массив, содержащий элементы перечисления "Статусы сообщений" (См. Перечисления.воСтатусыСообщений)
//
Функция ПолучитьСписокРабочихСтатусов() Экспорт
	
	массивСтатусы = Новый Массив;
	массивСтатусы.Добавить(Перечисления.воСтатусыСообщений.Новое);
	массивСтатусы.Добавить(Перечисления.воСтатусыСообщений.ОжиданиеОбработки);
	
	Возврат массивСтатусы;
	
КонецФункции	

// Функция - ПолучитьОбъектНабораЗаписейСостоянияСообщений
//
// Возвращаемое значение:
//	 РегистрСведенийНаборЗаписей - набор записей регистра воСостояниеСообщений
//
Функция ПолучитьОбъектНабораЗаписейСостоянияСообщений() Экспорт
	
	Набор = РегистрыСведений.воСостояниеВходящихСообщений.СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти