	
	// Контекст обрабтчика
	Если Ложь Тогда
		спрИмяТипаОбъекта = "";
	КонецЕсли;

	//////////// Код обработчика ////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТипыОбъектов.АлгоритмОбработки КАК АлгоритмОбработки
	|ИЗ
	|	Справочник.грТипыОбъектов КАК ТипыОбъектов
	|ГДЕ
	|	НЕ ТипыОбъектов.ПометкаУдаления
	|	И ТипыОбъектов.Включен
	|	И ТипыОбъектов.Наименование = &НаименованиеТипаОбъекта
	|	И (ВЫРАЗИТЬ(ТипыОбъектов.АлгоритмОбработки КАК СТРОКА(1000))) <> """"";
	
	Запрос.УстановитьПараметр("НаименованиеТипаОбъекта", спрИмяТипаОбъекта);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		Выполнить(Выборка.АлгоритмОбработки);
	КонецЕсли;
