#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьВыделенныеНаДозапрос(Команда)
	
	КоличествоВыделенных = Элементы.Список.ВыделенныеСтроки.Количество();
	Если КоличествоВыделенных = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю( "Не выделено ни одной строки" );
		Возврат;
	КонецЕсли; 
	
	Дозапросы = Новый Массив;
	Для каждого КлючЗаписи Из Элементы.Список.ВыделенныеСтроки Цикл
		Дозапросы.Добавить( КлючЗаписи );
	КонецЦикла; 
	
	ОтправитьВыделенныеНаДозапросНаСервере( Дозапросы );
	
	Элементы.Список.Обновить();
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю( "Дозапросы отправлены." );
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияДозапросов(Команда)
	ОткрытьФорму( "РегистрСведений.грОчередьДозапросов.Форма.РегистрацияДозапросов" );
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОтправитьВыделенныеНаДозапросНаСервере( Дозапросы )
	
	Для каждого КлючЗаписи Из Дозапросы Цикл
		
		РегистрыСведений.грОчередьДозапросов.ОтправитьДозапрос( КлючЗаписи.idflow, КлючЗаписи.Ключ );
		
	КонецЦикла;
	
КонецФункции

#КонецОбласти
