#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверитьЗаполнениеНастроек()
	
	КоличествоВыделенных = Элементы.Список.ВыделенныеСтроки.Количество();
	Если КоличествоВыделенных = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю( "Не выделено ни одной строки" );
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	грОтложенныеОперацииИнтеграцииКлиент.Подключаемый_ПроверитьВыполнениеЗадания(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФоновыеЗадания(ИмяКоманды)

	Если Не ПроверитьЗаполнениеНастроек() Тогда
		Возврат;
	КонецЕсли;
	
	грОтложенныеОперацииИнтеграцииКлиент.ЗапуститьФоновоеЗаданиеОбработатьИсточникиДанных(
		ЭтотОбъект,
		ИмяКоманды);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработатьПакеты(Команда)
	
	ЗапуститьФоновыеЗадания(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьДозапросы(Команда)
	
	ЗапуститьФоновыеЗадания(Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИсточниковДозапросов(Команда)
	
	ОткрытьФорму("РегистрСведений.грИсточникиДозапросов.Форма.ОбработкаИсточниковДозапросов");
	
КонецПроцедуры

#КонецОбласти

