#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ШаблонАлгоритма = "
	|//Ключи - Массив - базовая переменная
	|//ОтправлятьДозапросы - Булево - базовая переменная
	|
	|idflow = ""208"";
	|
	|Информация = Новый Структура;
	|Информация.Вставить( ""Описание"", ""корректировка данных"" );
	|
	|ДопПараметры = Новый Структура;
	|ДопПараметры.Вставить( ""ОтправлятьДозапрос"",  ОтправлятьДозапросы );
	|
	|МассивКлючей = СтрРазделить( Ключи, Символы.ПС );
	|Для каждого Ключ Из МассивКлючей Цикл
	|	
	|	Ключ = СтрЗаменить( Ключ, ""<"", """" );
	|	Ключ = СтрЗаменить( Ключ, "">"", """" );
	|	Если Не ЗначениеЗаполнено( Ключ ) Тогда
	|		Продолжить;
	|	КонецЕсли;
	|	
	|	РегистрыСведений.грОчередьДозапросов.ЗаписатьВОчередьДозапросов( Ключ, idflow, Информация, ДопПараметры );
	|	
	|КонецЦикла";
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьДозапросы(Команда)
	ЗаписатьДозапросыНаСервере();
	Сообщить( "Обработка завершена" );
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДозапросыНаСервере()
	
	Выполнить( ШаблонАлгоритма );
		
КонецПроцедуры

#КонецОбласти


