
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ДатаИзменения = ПолучитьДатуСеанса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ИдентификаторСообщения) тогда
		текЗапрос = Новый Запрос("ВЫБРАТЬ
		                         |	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		                         |	тбСостояние.ДатаИзменения КАК ДатаИзменения,
		                         |	тбОчередь.Хранилище КАК Хранилище,
		                         |	тбСостояние.ОписаниеОшибки КАК ОписаниеОшибки
		                         |ИЗ
		                         |	РегистрСведений.грОчередьВходящихСообщений КАК тбОчередь
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.грСостояниеВходящихСообщений КАК тбСостояние
		                         |		ПО тбОчередь.ИдентификаторСообщения = тбСостояние.ИдентификаторСообщения
		                         |ГДЕ
		                         |	тбОчередь.ИдентификаторСообщения = &ИдентификаторСообщения");
								 текЗапрос.УстановитьПараметр("ИдентификаторСообщения", Запись.ИдентификаторСообщения);
								 текВыборка = текЗапрос.Выполнить().Выбрать();
								 текВыборка.Следующий();
				 
		//++ Градум, Фоминский А.С., Задача 22233 , 11.08.2021
		Если Запись.ФорматСообщения = Перечисления.сшпФорматыСообщений.XML Тогда 
			Сообщение = ОтформатироватьXMLСтроку(текВыборка.Хранилище.Получить());
		Иначе	
			Сообщение = текВыборка.Хранилище.Получить();
		КонецЕсли;	
		//-- Градум, Фоминский А.С., Задача 22233 , 11.08.2021
		Статус = текВыборка.СтатусСообщения;
		ДатаИзменения = текВыборка.ДатаИзменения; 
		ОписаниеОшибки =  текВыборка.ОписаниеОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	грОбработкаПакетовИнтеграции.УстановитьСостояниеСообщения(Запись.ИдентификаторСообщения, Статус);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСеанса()
	Возврат  ТекущаяДатаСеанса();
КонецФункции	


//++ Градум, Фоминский А.С., Задача 22233 , 11.08.2021
&НаСервереБезКонтекста
Функция ОтформатироватьXMLСтроку( СтрокаСообщения )
		
	XDTOПакет = сшпОбщегоНазначения.ПолучитьОбъектXDTO(Константы.сшпФорматСообщений.Получить(), СтрокаСообщения);
	Если XDTOПакет = Неопределено Тогда
		Возврат "";
	КонецЕсли;		
	
	XDTOПакетBody = сшпОбщегоНазначения.ПолучитьОбъектXDTO(Константы.сшпФорматСообщений.Получить(), XDTOПакет.Body);
	
	ЗаписьXML = Новый ЗаписьXML; 
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML( ЗаписьXML, XDTOПакетBody, "classData" ); 
    ТекстОбъектаXDTO = ЗаписьXML.Закрыть();
	
	Возврат ТекстОбъектаXDTO;
	
КонецФункции
//-- Градум, Фоминский А.С., Задача 22233 , 11.08.2021

#КонецОбласти