
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Заголовок = ТекущийОбъект.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ИдентификаторШаблона) Тогда
		
		текЗапрос = Новый Запрос("ВЫБРАТЬ
								|	тбСостояние.Статус,
								|	тбСостояние.ДатаИзменения
								|ИЗ
								|	РегистрСведений.сшпСтатусыОбработчиков КАК тбСостояние
								|ГДЕ
								|	тбСостояние.ИдентификаторОбработчика = &ИдентификаторОбработчика");
		текЗапрос.УстановитьПараметр("ИдентификаторОбработчика", Запись.ИдентификаторШаблона);
		
		текВыборка = текЗапрос.Выполнить().Выбрать();
		
		текВыборка.Следующий();
		
		Статус = текВыборка.Статус;
		ДатаИзменения = текВыборка.ДатаИзменения;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти