
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания Экспорт;

&НаКлиенте
Перем ФормаДлительнойОперации Экспорт;

#КонецОбласти

#Область СлужебныеПроцедурыИфункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания() Экспорт
	
	грОтложенныеОперацииИнтеграцииКлиент.Подключаемый_ПроверитьВыполнениеЗадания(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура СнятьОшибкуНаСервере()
	
	Для Каждого СтрокаСписка Из Элементы.Список.ВыделенныеСтроки Цикл
		
		МенеджерЗаписи = РегистрыСведений.грОтложеннноеПроведение.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Документ = СтрокаСписка.Документ;
		МенеджерЗаписи.Прочитать();
		
		МенеджерЗаписи.ОписаниеОшибки = "";
		МенеджерЗаписи.Ошибка = Ложь;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПровестиДокументы(Команда)
	
	грОтложенныеОперацииИнтеграцииКлиент.ЗапуститьФоновоеЗаданиеОбработатьИсточникиДанных(
		ЭтотОбъект,
		Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОшибку(Команда)
	
	СнятьОшибкуНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти
