
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаДлительностиХранения.Загрузить(грESBРаботаСКонстантами.ПолучитьДлительностьХранения());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура грESBМаксимальноеЧислоОткладыванияСообщенийв1СПриИзменении(Элемент)
	
	УстановитьЗначениеКонстанты("грESBМаксимальноеЧислоОткладыванияСообщенийв1С");
	
КонецПроцедуры

&НаКлиенте
Процедура грESB_ИспользоватьВнутреннююОчередьПриИзменении(Элемент)
	
	УстановитьЗначениеКонстанты("грESB_ИспользоватьВнутреннююОчередь");
	
КонецПроцедуры

&НаКлиенте
Процедура грESBДлительностьХраненияВходящихСообщенийПриИзменении(Элемент)
	
	УстановитьЗначениеКонстанты("грESBДлительностьХраненияВходящихСообщений");
	
КонецПроцедуры

&НаКлиенте
Процедура грESBКоличествоПотоковОбработкиОчередейПриИзменении(Элемент)
	
	СтруктураВерности = СтруктураВерностиЗаполнения("грESBКоличествоПотоковОбработкиОчередей");
	Если СтруктураВерности.Ошибка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка при заполнении константы.
                                                                          |Общее количество потоков: %1 меньше или зарезервированным  потокам. Общее: %2, для очередей: %3.'")
		, Формат(СтруктураВерности.ТекущееЗначение, "ЧДЦ=0; ЧН=0")
		, Формат(СтруктураВерности.ОбщееКоличествоЗарезервированныхПотоков, "ЧДЦ=0; ЧН=0")
		, Формат(СтруктураВерности.ОбщееКоличествоЗарезервированныхПотоковПоОчередям, "ЧДЦ=0; ЧН=0")));
		Возврат;
	КонецЕсли;
	
	УстановитьЗначениеКонстанты("грESBКоличествоПотоковОбработкиОчередей");
	
КонецПроцедуры

&НаКлиенте
Процедура грESBКоличествоЗарезервированныхПотоковОбработкиОчередейПриИзменении(Элемент)
	
	СтруктураВерности = СтруктураВерностиЗаполнения("грESBКоличествоЗарезервированныхПотоковОбработкиОчередей");
	Если СтруктураВерности.Ошибка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Ошибка при заполнении константы.
                                                                          |Общее количество потоков: %1 меньше или зарезервированным  потокам. Общее: %2, для очередей: %3.'")
		, Формат(СтруктураВерности.ОбщееКоличествоПотоков, "ЧДЦ=0; ЧН=0")
		, Формат(СтруктураВерности.ТекущееЗначение, "ЧДЦ=0; ЧН=0")
		, Формат(СтруктураВерности.ОбщееКоличествоЗарезервированныхПотоковПоОчередям, "ЧДЦ=0; ЧН=0")));
		Возврат;
	КонецЕсли;
	
	УстановитьЗначениеКонстанты("грESBКоличествоЗарезервированныхПотоковОбработкиОчередей");
	
КонецПроцедуры

&НаКлиенте
Процедура грESBКоличествоПотоковОбработкиПриоритетовПриИзменении(Элемент)
	
	УстановитьЗначениеКонстанты("грESBКоличествоПотоковОбработкиПриоритетов");
	
КонецПроцедуры

&НаКлиенте
Процедура грESBКоличествоПотоковБалансировкиНагрузкиПриИзменении(Элемент)

	УстановитьЗначениеКонстанты("грESBКоличествоПотоковБалансировкиНагрузки");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДлительностиХранения

&НаКлиенте
Процедура ТаблицаДлительностиХраненияПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)

	УстановитьТаблицуДлительностиХранения();	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДлительностиХраненияПослеУдаления(Элемент)
	
	УстановитьТаблицуДлительностиХранения();	
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Функция - Установить значение константы
//
// Параметры:
//  ИмяКонстанты - константа, значение которой необходимо установить.
//  ЗначениеКонстанты - устанавливаемое значение.
// 
// Возвращаемое значение:
//	Булево - Изменение константы выполнено
//
Функция УстановитьЗначениеКонстанты(ИмяКонстанты)
	
	ЗначениеКонстанты = КонстантыНабор[ИмяКонстанты];
	
	ТекущееЗначение = ПолучитьЗначениеКонстанты(ИмяКонстанты);
	
	Если Не ТекущееЗначение = ЗначениеКонстанты Тогда
		
		Константы[ИмяКонстанты].Установить(ЗначениеКонстанты);
		ОбновитьПовторноИспользуемыеЗначения();
		Возврат Истина;
		
	Иначе
		 
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
// Функция - Получить значение константы
//
// Параметры:
//	ИмяКонстанты - имя константы, значение которой нужно получить.
//
// Возвращаемое значение:
//	Значение константы, определённой по имени.
//
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты)
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции	

&НаСервере
Процедура УстановитьТаблицуДлительностиХранения()
	
	грESBРаботаСКонстантами.УстановитьДлительностьХранения(ТаблицаДлительностиХранения.Выгрузить());
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Функция СтруктураВерностиЗаполнения(ИмяКонстанты)
	
	ЗначениеКонстанты = КонстантыНабор[ИмяКонстанты];
	ТекущееЗначение = ПолучитьЗначениеКонстанты(ИмяКонстанты);
	
	Если ИмяКонстанты = "грESBКоличествоПотоковОбработкиОчередей" Тогда
		ИзменяемоеКоличество = ТекущееЗначение - ЗначениеКонстанты;
	Иначе
		ИзменяемоеКоличество = ЗначениеКонстанты - ТекущееЗначение;
	КонецЕсли;
	
	СтруктураВозврата = грESBРаботаСКонстантами.ПроверитьЗаполнениеЗарезервированныхПотоков(ИзменяемоеКоличество);
	СтруктураВозврата.Вставить("ЗначениеКонстанты", ЗначениеКонстанты);
	СтруктураВозврата.Вставить("ТекущееЗначение", ТекущееЗначение);
	
	Если СтруктураВозврата.Ошибка Тогда
		КонстантыНабор[ИмяКонстанты] = ТекущееЗначение;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти