//======================================================================================================================
//Типы системы получателей
// УНИКУМ
// ЕРП
// УХ
// BITRIX
// РозницаВС
// РозницаАВ


ТекстОшибки = "";

Попытка
	
	РезультатОбработки.ClassId = 32;
	
	Данные = Новый Структура;
	Данные.Вставить("ID", ОбъектОбработки.Ключ );
	Данные.Вставить("Class", ОбъектОбработки.idflow );
	
	
	Receiver = "";
	
	ПустаяСтрока =  СтрДлина(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
	СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
	ОбъектОбработки.idflow, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", ""));
	
	ДозапросВ_УНИКУМ = ( ПустаяСтрока = 0 );
	
	Если ДозапросВ_УНИКУМ Тогда
		Receiver = "УНИКУМ";
	Иначе
		
		Описание_idflow = СтрРазделить( Данные.Class, "_" );
		Если Описание_idflow.Количество() > 1 Тогда
			Receiver = Описание_idflow[1];
			Данные.Class=Описание_idflow[0];
		КонецЕсли;
		
		Если Receiver = "BITRIX" И Данные.ID = "0" Тогда
			СостояниеСообщения = Перечисления.сшпСтатусыСообщений.ОбработкаОтменена;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено( Receiver )  Тогда
		ТекстСообщения = "Исходящее сообщение " + Строка(Идентификатор) + ". Не определена мастер система. idflow : %1";
		ТекстСообщения = СтрШаблон( ТекстСообщения, ОбъектОбработки.idflow ); 
		
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Properties = Новый Структура;
	Properties.Вставить( "RequestReceiver", Receiver);
	РезультатОбработки.Properties = Properties;
	
	РезультатОбработки.Body = сшпОбщегоНазначения.ПреобразоватьСтруктуруПоФормату(ФорматСообщения, Данные);	
	
	
Исключение
	
	ВызватьИсключение "Datareon. Ошибка при формировании дозапроса. "
	+ ?( ОбъектОбработки.Свойство( "МетаданныеПолноеИмя" ) , ОбъектОбработки.МетаданныеПолноеИмя  , "" ) 
	+"». Ключ: " + ОбъектОбработки.Ключ + ". " + ПодробноеПредставлениеОшибки( ИнформацияОбОшибке() ) 
	+ Символы.ПС + ТекстОшибки;
КонецПопытки;
