/////////////////////////////////////////////////
///Описание функционала дозапросов

//Мастер системы
// УНИКУМ
// ЕРП
// УХ
// BITRIX
// РозницаВС
// РозницаАВ
// TL

//Типы ключей
// GUID

//Виды ключей
// Шаблон ВидКлюча МастерСистема_ТипКлюча
//
// УНИКУМGUID 
// УНИКУМКод
// УНИКУМШтрихкод
// ЕРПGUID
// УХGUID 
// BITRIXGUID
// РозницаАВGUID
// РозницаВСGUID
// TL_GUID


КвалификаторСтроки = Новый КвалификаторыСтроки(150, ДопустимаяДлина.Переменная); 
ОписаниеТипаСтрока = Новый ОписаниеТипов( "Строка", , , , КвалификаторСтроки );

грИдентификаторыПотоковESB = Новый ТаблицаЗначений;
//Шаблон idflow{МетаданныеПолноеИмяМастерСистема}_{МастерСистема}_{ВидКлюча}  , УНИКУМ цифровой idlow
грИдентификаторыПотоковESB.Колонки.Добавить( "idflow", ОписаниеТипаСтрока );
//Шаблон idflow_redirect{МетаданныеПолноеИмяМастерСистема}_{МастерСистема}_{ВидКлюча}  , УНИКУМ цифровой idlow
грИдентификаторыПотоковESB.Колонки.Добавить( "idflow_redirect", ОписаниеТипаСтрока );  // перенаправление дозапроса

грИдентификаторыПотоковESB.Колонки.Добавить( "Включен", Новый ОписаниеТипов( "Булево" ) );
грИдентификаторыПотоковESB.Колонки.Добавить( "ВидКлюча", ОписаниеТипаСтрока );
грИдентификаторыПотоковESB.Колонки.Добавить( "ПоискВТПК", Новый ОписаниеТипов( "Булево" ) );
грИдентификаторыПотоковESB.Колонки.Добавить( "МетаданныеПолноеИмя", ОписаниеТипаСтрока );
грИдентификаторыПотоковESB.Колонки.Добавить( "МетаданныеПолноеИмяИнициаторДозапроса", ОписаниеТипаСтрока );

// правило формирования Мнемокод "{МастерСистема}.{МетаданныеПолноеИмяМастерСистема}.{ВидКлюча*}" "УНИКУМ.Справочник.АГТ"
//{ВидКлюча*} добавляется, если по запрашиваему объекту несколько idflow
грИдентификаторыПотоковESB.Колонки.Добавить( "Мнемокод", ОписаниеТипаСтрока ); 

//======================================================================================================================
//Дозапросы в УНИКУМ

//НСИ
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Банки"; 
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.КлассификаторБанков";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Банки";
НоваяСтрока.idflow = "318";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМШтрихкод";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "РегистрСведений.ШтрихкодыНоменклатуры"; 
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Номенклатура.УНИКУМШтрихкод";
НоваяСтрока.idflow = "УНИКУМШтрихкод";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМКодАГТ";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.АналитическиеГруппыТоваров";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Номенклатура"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.АналитическиеГруппыТоваров";
НоваяСтрока.idflow = "333"; 

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.БанковскиеСчета";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.БанковскиеСчета";
НоваяСтрока.idflow = "225";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Валюты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Валюты";
НоваяСтрока.idflow = "227";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыДоходовИРасходов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ПрочиеДоходыИРасходы"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ВидыДоходовИРасходов";
НоваяСтрока.idflow = "445";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыРезервов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Резервы"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ВидыРезервов";
НоваяСтрока.idflow = "447";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЗначенияСубконто";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.РасходыБудущихПериодов"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЗначенияСубконто.РасходыБудущихПериодов";
НоваяСтрока.idflow = "451";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ДвиженияДенежныхСредств";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ДвиженияДенежныхСредств";
НоваяСтрока.idflow = "316";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Кассы";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Кассы";
НоваяСтрока.idflow = "317";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ИнвентаризацияТерминал";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ИнвентаризацияТерминал";
НоваяСтрока.idflow = "307";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ОсновныеСредства_НМА";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.СпособыОтраженияРасходовПоАмортизации"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ОсновныеСредства_НМА.СпособыОтраженияРасходовПоАмортизации";
НоваяСтрока.idflow = "433";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ОсновныеСредства_НМА";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ОсновныеСредства"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ОсновныеСредства_НМА.ОсновныеСредства";
НоваяСтрока.idflow = "441";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.УправНакладная";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.РеализацияТоваровУслуг"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.УправНакладная";
НоваяСтрока.idflow = "208";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.РасходнаяНакладная";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.РеализацияТоваровУслуг"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.РасходнаяНакладная";
НоваяСтрока.idflow = "208";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.РасходнаяНакладнаяОпт";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.РеализацияТоваровУслуг"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.РасходнаяНакладнаяОпт";
НоваяСтрока.idflow = "208";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Отделы";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Отделы";
НоваяСтрока.idflow = "294";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СтатьиИздержек";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.СтатьиИздержек";
НоваяСтрока.idflow = "372";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыРасходовУчередителей";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грРасходыУчредителей"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ВидыРасходовУчередителей";
НоваяСтрока.idflow = "494";

//Павел Тимофеев
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Сектора";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грСектора";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Сектора";
НоваяСтрока.idflow = "264";

// +++ Градум Теплоухов Задача № 17513
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Пользователи";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Пользователи";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Пользователи";
НоваяСтрока.idflow = "319";
// --- Градум Теплоухов Задача № 17513

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СрокиГодности";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грСрокиГодности";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.СрокиГодности";
НоваяСтрока.idflow = "249";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ГТДНовый";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.НомераГТД";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ГТДНовый";
НоваяСтрока.idflow = "277";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЗначенияСвойств";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грЛинейкиАлкогольнойПродукции";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЗначенияСвойств";
НоваяСтрока.idflow = "257";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Территории";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грТерритории";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Территории";
НоваяСтрока.idflow = "253";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЗначенияСвойств";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ЗначенияСвойствОбъектов, Производители, грЧастныеМарки, грСодержаниеСпирта, грСодержаниеСахара, грКатегорииВыдержки";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЗначенияСвойств";
НоваяСтрока.idflow = "290";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЕдиныеКодыВАП";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ВидыАлкогольнойПродукции";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЕдиныеКодыВАП";
НоваяСтрока.idflow = "291";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЗначенияСвойств";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грАссортиментнаяДистрибьюция";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЗначенияСвойств";
НоваяСтрока.idflow = "235";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КаналыСбыта";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грКаналыСбыта";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.КаналыСбыта";
НоваяСтрока.idflow = "256";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СтруктураСкладов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грМестаХранения";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.СтруктураСкладов";
НоваяСтрока.idflow = "293";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Контрагенты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Контрагенты";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Контрагенты";
НоваяСтрока.idflow = "224";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Номенклатура";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Номенклатура";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Номенклатура.УНИКУМGUID";
НоваяСтрока.idflow = "263";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМКодАГТ";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Номенклатура";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Номенклатура";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Номенклатура.УНИКУМКодАГТ ";
НоваяСтрока.idflow = "УНИКУМНоменклатураКодАГТ";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМКод";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Номенклатура";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Номенклатура";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Номенклатура.УНИКУМКод";
НоваяСтрока.idflow = "УНИКУМНоменклатураКод";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ИсторияЛицензий";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ЛицензииПоставщиковАлкогольнойПродукции";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ИсторияЛицензий";
НоваяСтрока.idflow = "252";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Фирмы";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Организации";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Фирмы";
НоваяСтрока.idflow = "228";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ОбособленныеПодразделения";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ПодразделенияОрганизаций";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ОбособленныеПодразделения";
НоваяСтрока.idflow = "255";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Сотрудники";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ФизическиеЛица";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ФизическиеЛица";
НоваяСтрока.idflow = "327";

//НоваяСтрока = грИдентификаторыПотоковESB.Добавить();  ///?????
//НоваяСтрока.Включен = Истина ;
//НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
//НоваяСтрока.ПоискВТПК = ЛОЖЬ;
//НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Сотрудники";
//НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Сотрудники";
//НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Сотрудники";
//НоваяСтрока.idflow = "114";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Сотрудники";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грМенеджеры";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.грМенеджеры";
НоваяСтрока.idflow = "326";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Контрагенты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.КлассификаторОрганизацийЕГАИС";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Контрагенты";
НоваяСтрока.idflow = "311";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Контрагенты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грБизнесПартнеры";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Контрагенты";
НоваяСтрока.idflow = "236";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЕГАИС_АлкКоды";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.КлассификаторАлкогольнойПродукцииЕГАИС";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЕГАИС_АлкКоды";
НоваяСтрока.idflow = "300";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СтруктураКаналаСбыта";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Партнеры";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.СтруктураКаналаСбыта";
НоваяСтрока.idflow = "341";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.МестаХранения";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Склады";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.МестаХранения";
НоваяСтрока.idflow = "338";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СтруктураСкладов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.СкладскиеПомещения";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.СтруктураСкладов";
НоваяСтрока.idflow = "299";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ИдентификаторыРазделовА";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Справки1ЕГАИС";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ИдентификаторыРазделовА";
НоваяСтрока.idflow = "298";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ИдентификаторыРазделовБ";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Справки2ЕГАИС";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ИдентификаторыРазделовБ";
НоваяСтрока.idflow = "312";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ПартииТоваров";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.СерииНоменклатуры";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ПартииТоваров";
НоваяСтрока.idflow = "230";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Договора";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ДоговорыКонтрагентов";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Договора";
НоваяСтрока.idflow = "229";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КатегорииЦен";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ВидыЦен";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.КатегорииЦен";
НоваяСтрока.idflow = "345";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЦеноваяГруппа";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грЦеновыеГруппыАП";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЦеноваяГруппа";
НоваяСтрока.idflow = "344";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СубрегионыДляПрайса, Справочник.Апеласьон, Справочник.КатегорииНапитковДляПрайса, Справочник.ЛинейкиТипыНапитковДляПрайса, Справочник.СтраныДляПрайса, Справочник.РегионыДляПрайса, Справочник.ПоставщикиДляПрайса";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ЗначенияСвойствОбъектов";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.СубрегионыДляПрайса, Справочник.Апеласьон, Справочник.КатегорииНапитковДляПрайса, Справочник.ЛинейкиТипыНапитковДляПрайса, Справочник.СтраныДляПрайса, Справочник.РегионыДляПрайса, Справочник.ПоставщикиДляПрайса";
НоваяСтрока.idflow = "301";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КоммерческиеУсловия";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.СоглашенияСКлиентами";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.КоммерческиеУсловия";
НоваяСтрока.idflow = "347";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СпецификацииСУсловиями";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.СоглашенияСКлиентами";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.СпецификацииСУсловиями";
НоваяСтрока.idflow = "347";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Сотрудники";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ТранспортныеСредства";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ТранспортныеСредства";
НоваяСтрока.idflow = "351";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.НоменклатураКоммерческихУсловий, Справочник.СвойстваАналитическойГруппыКоммерческихУсловий, Справочник.АналитическаяГруппаКоммерческихУсловий, Справочник.ТоварыПоСпецификацииСУсловиями";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грСкидкиКУ";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.НоменклатураКоммерческихУсловий, Справочник.СвойстваАналитическойГруппыКоммерческихУсловий, Справочник.АналитическаяГруппаКоммерческихУсловий, Справочник.ТоварыПоСпецификацииСУсловиями";
НоваяСтрока.idflow = "348";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ДетализацияСтатейЗатрат";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грЗатратыКУ";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ДетализацияСтатейЗатрат";
НоваяСтрока.idflow = "350";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КлассификаторЕдИзм";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.УпаковкиЕдиницыИзмерения";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.КлассификаторЕдИзм";
НоваяСтрока.idflow = "275";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ЗначенияСвойств";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.КлассификаторТНВЭД";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ЗначенияСвойств";
НоваяСтрока.idflow = "278";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.МаркетинговыеАкции";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.СкидкиНаценки";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.МаркетинговыеАкции";
НоваяСтрока.idflow = "358";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ТипыМарок";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грТипыАкцизныхМарокЕГАИС";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ТипыМарок";
НоваяСтрока.idflow = "424";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Номенклатура";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грКонтрэтикетки";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Номенклатура";
НоваяСтрока.idflow = "425";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.УсловияОплатыПодробно";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грУсловияОплатыПоставщикам";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.УсловияОплатыПодробно";
НоваяСтрока.idflow = "464";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ПрайсHoReCa";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грПрайсHoReCa";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.ПрайсHoReCa";
НоваяСтрока.idflow = "440";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = ЛОЖЬ;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Проекты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.грКаналыСбытаУУ";
НоваяСтрока.Мнемокод = "УНИКУМ.Справочник.Проекты";
НоваяСтрока.idflow = "493";

//Документы
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.Заказ";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ЗаказПоставщику"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ЗаказПоставщику";
//НоваяСтрока.idflow = "101";
НоваяСтрока.idflow = "519";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.КорректировкаЗаказа";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ЗаказПоставщику"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.КорректировкаЗаказа";
НоваяСтрока.idflow = "281";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ПоступлениеНаТранзитныйСклад";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ЗаказПоставщику"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ПоступлениеНаТранзитныйСклад";
НоваяСтрока.idflow = "282";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.Счет";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.грРаспоряжениеНаДоставку"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.Счет";
НоваяСтрока.idflow = "438";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ВозвратОтПокупателя";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ВозвратТоваровОтКлиента"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ВозвратОтПокупателя";
НоваяСтрока.idflow = "215";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ПриходнаяНакладная";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ПриобретениеТоваровУслу"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ПриходнаяНакладная";
НоваяСтрока.idflow = "551";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.Перемещение";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ПеремещениеТоваров"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.Перемещение";
НоваяСтрока.idflow = "216";

//+Заказы клиентов
// Возможные документы в УНИКУМ
//Документ.ЗаказCRM
//Документ.Документ.ЗаказКПК
//Документ.ЗаказДРТ
//Документ.Заявка

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ЗаказCRM";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ЗаказКлиента"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ЗаказCRM"; 
НоваяСтрока.idflow = "343";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ЗаказКПК";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ЗаказКлиента"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ЗаказКПК"; 
НоваяСтрока.idflow = "343";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ЗаказДРТ";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ЗаказКлиента"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ЗаказДРТ"; 
НоваяСтрока.idflow = "343";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.Заявка";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ЗаказКлиента"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.Заявка"; 
НоваяСтрока.idflow = "343";

//-Заказы клиентов

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ЕГАИС_ТТНИсходящая";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ТТНИсходящаяЕГАИС"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ЕГАИС_ТТНИсходящая";
НоваяСтрока.idflow = "332";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ЕГАИС_ТТНВходящая";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ТТНВходящаяЕГАИС"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ЕГАИС_ТТНВходящая";
НоваяСтрока.idflow = "328";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.Счет";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.Счет"; 
НоваяСтрока.idflow = "522";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.СправкиБ";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.СправкиБ"; 
НоваяСтрока.idflow = "335";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.Партии";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.Партии"; 
НоваяСтрока.idflow = "320";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча = "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ВозвратПоставщику";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ВозвратТоваровПоставщику"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ВозвратПоставщику";
НоваяСтрока.idflow = "223";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча = "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.АктОРасхождении";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.КорректировкаРеализации"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.АктОРасхождении";
НоваяСтрока.idflow = "233";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча = "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.АктОРасхождении_Исходящий";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.КорректировкаПриобретения"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.АктОРасхождении_Исходящий";
НоваяСтрока.idflow = "218";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.Списание";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.СписаниеНедостачТоваров"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.Списание";
НоваяСтрока.idflow = "219";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ОприходованиеИзлишков";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ОприходованиеИзлишковТоваров"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ОприходованиеИзлишков";
НоваяСтрока.idflow = "220";	

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ПеремещениеМеждуТранзитнымиСкладами";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ПеремещениеТоваров"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ПеремещениеМеждуТранзитнымиСкладами"; 
НоваяСтрока.idflow = "216";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ПриходнаяНакладная";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ПеремещениеТоваров"; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.ПриходнаяНакладная"; 
НоваяСтрока.idflow = "216";
//======================================================================================================================
// Дозапросы в УХ
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.БанковскиеСчета";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.БанковскиеСчетаОрганизаций";
НоваяСтрока.Мнемокод = "УХ.Справочник.БанковскиеСчета";
НоваяСтрока.idflow = "БанковскиеСчета_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Истина;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СтатьиДвиженияДенежныхСредств";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УХ.Справочник.СтатьиДвиженияДенежныхСредств.УНИКУМGUID";
НоваяСтрока.idflow = "СтатьиДвиженияДенежныхСредств_УХ_УНИКУМGUID"; 

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Ложь ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Валюты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Валюты";
НоваяСтрока.Мнемокод = "УХ.Справочник.Валюты";
НоваяСтрока.idflow = "Валюты_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Ложь ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Кассы";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.КассыККМ";
НоваяСтрока.Мнемокод = "УХ.Справочник.Кассы";
НоваяСтрока.idflow = "Кассы_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.УпаковкиЕдиницыИзмерения";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УХ.Справочник.СтатьиДвиженияДенежныхСредств";
НоваяСтрока.idflow = "СтатьиДвиженияДенежныхСредств_УХ_УХGUID";

//======================================================================================================================
//Дозапросы в ЕРП
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.УпаковкиЕдиницыИзмерения";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.УпаковкиЕдиницыИзмерения.ЕРПGUID";
НоваяСтрока.idflow = "УпаковкиЕдиницыИзмерения_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Истина;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.УпаковкиЕдиницыИзмерения";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.БанковскиеСчетаКонтрагентов.УНИКУМGUID";
НоваяСтрока.idflow = "УпаковкиЕдиницыИзмерения_ЕРП_УНИКУМGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Истина;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ЗаказПоставщику";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Документ.ЗаказПоставщику";
НоваяСтрока.idflow = "ЗаказПоставщику_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.БанковскиеСчетаКонтрагентов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.БанковскиеСчетаКонтрагентов";
НоваяСтрока.idflow = "БанковскиеСчетаКонтрагентов_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Ложь ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыКонтактнойИнформации";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ВидыКонтактнойИнформации";
НоваяСтрока.idflow = "ВидыКонтактнойИнформации_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыНоменклатуры";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ВидыНоменклатуры";
НоваяСтрока.idflow = "ВидыНоменклатуры_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыЦен";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ВидыЦен";
НоваяСтрока.idflow = "ВидыЦен_ЕРП_ЕРПGUID";

//ДоговорыКонтрагентов
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ДоговорыКонтрагентов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ДоговорыКонтрагентов";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ДоговорыКонтрагентов.ЕРПGUID";
НоваяСтрока.idflow = "ДоговорыКонтрагентов_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Истина;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ДоговорыКонтрагентов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ДоговорыКонтрагентов.УНИКУМGUID";
НоваяСтрока.idflow = "ДоговорыКонтрагентов_ЕРП_УНИКУМGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Ложь ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КаналыСбыта";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.КаналыСбыта";
НоваяСтрока.idflow = "КаналыСбыта_ЕРП_ЕРПGUID";

//Контрагенты
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Контрагенты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Контрагенты";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Контрагенты.ЕРПGUID";
НоваяСтрока.idflow = "Контрагенты_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Истина;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Контрагенты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Контрагенты.УНИКУМGUID";
НоваяСтрока.idflow = "Контрагенты_ЕРП_УНИКУМGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Номенклатура";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Номенклатура";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Номенклатура";
НоваяСтрока.idflow = "Номенклатура_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.НомераГТД";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.НомераГТД";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.НомераГТД";
НоваяСтрока.idflow = "НомераГТД_ЕРП_ЕРПGUID";

//Организации
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Организации";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Организации.ЕРПGUID";
НоваяСтрока.idflow = "Организации_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Истина;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Организации";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Организации.УНИКУМGUID";
НоваяСтрока.idflow = "Организации_ЕРП_УНИКУМGUID";

//Пользователи
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Пользователи";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Пользователи.ЕРПGUID";
НоваяСтрока.idflow = "Пользователи_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Истина;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Пользователи";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Пользователи.УНИКУМGUID";
НоваяСтрока.idflow = "Пользователи_ЕРП_УНИКУМGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Ложь ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.РеализацияТоваровУслуг";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Документ.РеализацияТоваровУслуг";
НоваяСтрока.idflow = "РеализацияТоваровУслуг_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Склады";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.Склады";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Склады";
НоваяСтрока.idflow = "Склады_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СтраныМира";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.СтраныМира";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Склады";
НоваяСтрока.idflow = "СтраныМира_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ФизическиеЛица";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Справочник.ФизическиеЛица";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ФизическиеЛица";
НоваяСтрока.idflow = "ФизическиеЛица_ЕРП_ЕРПGUID";

//======================================================================================================================
//ЕРП.Документы
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.ПриобретениеТоваровУслуг";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "Документ.ПоступлениеТоваровУслуг";
НоваяСтрока.Мнемокод = "ЕРП.Документ.ПриобретениеТоваровУслуг";
НоваяСтрока.idflow = "ПриобретениеТоваровУслуг_ЕРП_ЕРПGUID";

//======================================================================================================================
//Розница
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "РозницаВСGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Склады";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "РозницаВС.Справочник.Склады";
НоваяСтрока.idflow = "Склады_РозницаВС_РозницаВСGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "РозницаАВGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.РеализацияТоваровУслуг";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "РозницаАВ.Документ.РеализацияТоваровУслуг";
НоваяСтрока.idflow = "РеализацияТоваровУслуг_РозницаАВ_РозницаАВGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "РозницаВСGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.РеализацияТоваровУслуг";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "РозницаВС.Документ.РеализацияТоваровУслуг";
НоваяСтрока.idflow = "РеализацияТоваровУслуг_РозницаВС_РозницаВСGUID";

//Добавленные с онлайн документа
НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КонтактныеЛицаПартнеров";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.КонтактныеЛицаПартнеров";
НоваяСтрока.idflow = "КонтактныеЛицаПартнеров_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.РолиКонтактныхЛицПартнеров";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.РолиКонтактныхЛицПартнеров";
НоваяСтрока.idflow = "РолиКонтактныхЛицПартнеров_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Банки";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УХ.Справочник.Банки";
НоваяСтрока.idflow = "Банки_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ГосударственныеКонтракты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ГосударственныеКонтракты";
НоваяСтрока.idflow = "ГосударственныеКонтракты_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ПриоритетыПлатежей";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УХ.Справочник.ПриоритетыПлатежей";
НоваяСтрока.idflow = "ПриоритетыПлатежей_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.грКаналыСбыта";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.грКаналыСбыта";
НоваяСтрока.idflow = "грКаналыСбыта_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.БанковскиеСчетаОрганизации";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УХ.Справочник.БанковскиеСчетаОрганизации";
НоваяСтрока.idflow = "БанковскиеСчетаОрганизации_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ПодразделенияОрганизаций";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ПодразделенияОрганизаций";
НоваяСтрока.idflow = "ПодразделенияОрганизаций_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.Должности";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.Должности";
НоваяСтрока.idflow = "Должности_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.СкладскиеПомещения";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.СкладскиеПомещения";
НоваяСтрока.idflow = "СкладскиеПомещения_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ПрочиеДоходыИРасходы";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УХ.Справочник.ПрочиеДоходыИРасходы";
НоваяСтрока.idflow = "ПрочиеДоходыИРасходы_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "УХGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыВзаиморасчетов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "УХ.Справочник.ВидыВзаиморасчетов";
НоваяСтрока.idflow = "ВидыВзаиморасчетов_УХ_УХGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.грАссортиментнаяДистрибуция";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.грАссортиментнаяДистрибуция";
НоваяСтрока.idflow = "грАссортиментнаяДистрибуция_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ДоговорыКредитовИДепозитов";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ДоговорыКредитовИДепозитов";
НоваяСтрока.idflow = "ДоговорыКредитовИДепозитов_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ВидыАлкогольнойПродукции";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ВидыАлкогольнойПродукции";
НоваяСтрока.idflow = "ВидыАлкогольнойПродукции_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.ГрафикиОплаты";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.ГрафикиОплаты";
НоваяСтрока.idflow = "ГрафикиОплаты_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина ;
НоваяСтрока.ВидКлюча =  "ЕРПGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КлассификаторТНВЭД";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = "";
НоваяСтрока.Мнемокод = "ЕРП.Справочник.КлассификаторТНВЭД";
НоваяСтрока.idflow = "КлассификаторТНВЭД_ЕРП_ЕРПGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();  
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.СнятиеРезерваЧастичное";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.СнятиеРезерваЧастичное"; 
НоваяСтрока.idflow = "522";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "УНИКУМGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.СнятиеРезерва";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "УНИКУМ.Документ.СнятиеРезерва"; 
НоваяСтрока.idflow = "522";

//--------------------------------Битрикс---------------------------------------------

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "BITRIXGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.грМенеджеры";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "БИТРИКС.Справочник.Пользователи"; 
НоваяСтрока.idflow = "497_Bitrix_BITRIXGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "BITRIXGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Документ.грЗаказНаТочкуВыдачи";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = "БИТРИКС.Документ.Сделка"; 
НоваяСтрока.idflow = "428_Bitrix_BITRIXGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "BITRIXGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.МаркетинговыеМероприятия";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = ""; 
НоваяСтрока.idflow = "496_Bitrix_BITRIXGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "BITRIXGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.грБизнесПартнеры";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = ""; 
НоваяСтрока.idflow = "523_Bitrix_BITRIXGUID";

НоваяСтрока = грИдентификаторыПотоковESB.Добавить();
НоваяСтрока.Включен = Истина;
НоваяСтрока.ВидКлюча =  "BITRIXGUID";
НоваяСтрока.ПоискВТПК = Ложь;
НоваяСтрока.МетаданныеПолноеИмя = "Справочник.КонтактныеЛицаПартнеров";
НоваяСтрока.МетаданныеПолноеИмяИнициаторДозапроса = ""; 
НоваяСтрока.Мнемокод = ""; 
НоваяСтрока.idflow = "384_Bitrix_BITRIXGUID";

//--------------------------------Битрикс--Конец--------------------------------


РезультатВыполнения = грИдентификаторыПотоковESB;
