#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция СтруктураДанныхНастройки()  
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Значение
	|ПОМЕСТИТЬ Представления_Настройки_ИМЯ_НАСТРОЙКИ
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ЗапросПоПредставлению( ТекстЗапроса )  Экспорт
	
	ПолученныйТекстЗапроса = грУправлениеНастройками.ЗапросПоПредставлению(ТекстЗапроса);
	
	Возврат ПолученныйТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗначениеНастройки( ИмяНастройки )  Экспорт
	
	Результат = грУправлениеНастройкамиПовтИсп.ПолучитьЗначениеНастройки(ИмяНастройки);
	
	Возврат Результат;
	
КонецФункции //ПолучитьЗначение()

Функция ПолучитьОписаниеНастройки(Настройка) Экспорт
	
	ТекстОписания = "";
	
	Если Настройка = Справочники.грНастройкиПоУмолчанию.БитриксURL Тогда
		ТекстОписания = "URL системы Битрикс24 вида ""http://dev3.crm.l-wine.ru"". Используется для открытия ссылок на документы в Битрикс24 из ERP";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.БитриксСистемаКонтура Тогда
		ТекстОписания = "Элемент из справочника ""Системы интеграционного контура"", соответствующий Битрикс24. Используется для определения идентификаторов Битрикс24 в механизмах ERP";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.ПриоритетИнтересаПоУмолчанию Тогда
		ТекстОписания = "Элемент из справочника ""Приоритеты"". Используется при создании нового документа ""Интерес"" и документов ""Заказа клиента"", связанных с ""Интересом""";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.БизнесРегионМосква Тогда
		ТекстОписания = "Элемент из справочника ""Бизнес-регионы"". Используется в механизмах клиентскоо сервиса для определени остатков";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.ОтключитьПроверкиСКС Тогда
		ТекстОписания = "Булево. Если установлено Истина, то при записи справочника ""Узлы СКС"" не будут производится проверки иерархии СКС и т.п.";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.МенеджерДУИВСпоУмолчанию Тогда
		ТекстОписания = "Элемент справочника Менеджеры (гр)";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.ТочкаВыдачиНеЗаполнена Тогда
		ТекстОписания = "Элемент справочника ""Бизнес-партнеры"" в иерархии ""Точки выдачи"", который будет установлен при загрузке сделки из Б24, если сценарий соответствует точкам выдачи, но идентификатор точки выдачи не заполнен в пакете";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.НастройкаХраненияИсторииИзмененияДокументов Тогда
		ТекстОписания = "Элемент справочника Настройки хранения бинарных объектов (Гр)";
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.ПолучитьОстаткиПоВидамСкладовКСИЗВнешнихСистем Тогда
		ТекстОписания = "Булево. Если ИСТИНА, то для вывода на форме документа ""Интерес"" остатков по видам складов КС используются данные из регистра ""Остатки товаров во внешних системах (гр)""";
	// ++ Градум Вахрушев А.В. 29.06.2021 Задача № ERP-482
	ИначеЕсли Настройка = Справочники.грНастройкиПоУмолчанию.ПодарочнаяАкцияПоУмолчанию Тогда
		ТекстОписания = "Значение акции, устанавливаемой при загрузке сделки для строк, с признаком IS_GIFT = 1 и незаполненной или ненайденой акцией.";
	// -- Градум Вахрушев А.В. 29.06.2021 Задача № ERP-482		
	КонецЕсли;

	 
	
	Возврат ТекстОписания;
	
КонецФункции

#КонецОбласти  //ПрограммныйИнтерфейс


#Область СлужебныеПроцедурыИФункции



#КонецОбласти   //СлужебныеПроцедурыИФункции

#КонецЕсли
