#Область ПрограммныйИнтерфейс

// Функция - Получить объект потокового чтения
//
// Параметры:
//	ЧитаемыеДанные - данные, которые необходимо последовательно прочитать.
// 
// Возвращаемое значение:
//	ЧтениеFastInfoset - объект чтения XML данных.
//
Функция ПолучитьОбъектПотоковогоЧтения(ЧитаемыеДанные) Экспорт
	
	ТекЧтение = Новый ЧтениеFastInfoset;
	
	Если ТипЗнч(ЧитаемыеДанные) = Тип("ДвоичныеДанные") Тогда
		
		ТекЧтение.УстановитьДвоичныеДанные(ЧитаемыеДанные);
		
	Иначе
		
		ТекЧтение.УстановитьДвоичныеДанные(Base64Значение(ЧитаемыеДанные));
		
	КонецЕсли;
	
	Возврат ТекЧтение;
	
КонецФункции

// Функция - Прочитать объект из потока
//
// Параметры:
//	Поток - объект чтения XML, которых нужно прочитать.
//	ТипОбъекта - тип объекта для чтения.
// 
// Возвращаемое значение:
//	Произвольный - Результат чтения объекта.
//
Функция ПрочитатьОбъектИзПотока(Поток, ТипОбъекта) Экспорт
	
	Возврат ФабрикаXDTO.ПрочитатьXML(Поток, ТипОбъекта);
	
КонецФункции

#КонецОбласти
