// Модуль описания оберток для получения значений функциональных опции. 
// При использовании конфигурации на платформе 8.1 необходимо заменить обращение к функциональным опциям на получение значений одноименных констант.
// Использование функциональных опций позволяет кэшировать наиболее востребованные значения в памяти рабочего потока.

#Область ПрограммныйИнтерфейс

// Функция - Формат сериализации
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпФорматСериализации".
//
Функция ФорматСериализации() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпФорматСериализации");
	
КонецФункции

// Функция - Использовать СШП
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпИспользоватьСШП".
//
Функция ИспользоватьСШП() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпИспользоватьСШП");
	
КонецФункции

// Функция - Отключить потоки
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпОтключитьПотоки".
//
Функция ОтключитьПотоки() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпОтключитьПотоки");
	
КонецФункции

// Функция - Версия обработчиков
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпВерсияОбработчиков".
//
Функция ВерсияОбработчиков() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпВерсияОбработчиков");
	
КонецФункции

// Функция - Версия параметров подсистемы
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпВерсияПараметровПодсистемы".
//
Функция ВерсияПараметровПодсистемы() Экспорт
	 
	Возврат ПолучитьФункциональнуюОпцию("сшпВерсияПараметровПодсистемы");
	
КонецФункции

// Функция - Формат сообщения
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпФорматСообщения".
//
Функция ФорматСообщения() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпФорматСообщения");
	
КонецФункции

// Функция - Адрес адаптера ESB
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпАдресАдаптераESB".
//
Функция АдресАдаптераESB() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпАдресАдаптераESB");
	
КонецФункции

// Функция - Имя сервиса ESB
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпИмяСервисаESB".
//
Функция ИмяСервисаESB() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпИмяСервисаESB");
	
КонецФункции

// Функция - Имя точки подключения ESB
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпИмяТочкиПодключенияESB".
//
Функция ИмяТочкиПодключенияESB() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпИмяТочкиПодключенияESB");
	
КонецФункции

// Функция - Тип используемого коннектора ESB
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпТипИспользуемогоКоннектораESB".
//
Функция ТипИспользуемогоКоннектораESB() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпТипИспользуемогоКоннектораESB");
	
КонецФункции

// Функция - Автоматический старт обработчиков
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпАвтоматическийСтартОбработчиков".
//
Функция АвтоматическийСтартОбработчиков() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпАвтоматическийСтартОбработчиков");
	
КонецФункции

// Функция - Отключить соединение
// 
// Возвращаемое значение:
//	Значение функциональной опции "сшпОтключитьСоединение".
//
Функция ОтключитьСоединение() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("сшпОтключитьСоединение");
	
КонецФункции

#КонецОбласти
