#Область ПрограммныйИнтерфейс

#Область ДлительныеОперации

Функция ЗаданиеВыполнено(ИдентификаторЗадания) Экспорт
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

Функция ЗапуститьОбработкуВФоновомРежиме(ВыполняемыйМетод, ПараметрыЗадания ) Экспорт 
	
	Результат = грОтложенныеОперацииИнтеграции.ЗапуститьОбработкуВФоновомРежиме(ВыполняемыйМетод, ПараметрыЗадания );
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

Процедура ОчиститьВыключенныеРегламентыеЗадания() Экспорт 
	грОтложенныеОперацииИнтеграции.ОчиститьВыключенныеРегламентыеЗадания();	
КонецПроцедуры


#КонецОбласти
