
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИзESB(Команда)
	ОбновитьИзESBНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьИзESBНаСервере()
	
	ИмяНастройки = "ПрефиксОбработчиковСборки";
	ПрефиксКласса = Справочники.грНастройкиПоУмолчанию.ПолучитьЗначениеНастройки( ИмяНастройки );
	
	Объект.АлгоритмОбработки = грОбработкаПакетовИнтеграции.ПолучитьТекстОбработчика( ПрефиксКласса + Объект.Наименование, 
									Перечисления.сшпТипыИнтеграции.Исходящая );
КонецПроцедуры

#КонецОбласти

