#Область ПрограммныйИнтерфейс

// Функция - Получить объект потокового чтения
//
// Параметры:
//	ЧитаемаяСтрока - данные, которые необходимо последовательно прочитать.
// 
// Возвращаемое значение:
//	ЧтениеJSON - объект чтения JSON данных.
//
Функция ПолучитьОбъектПотоковогоЧтения(ЧитаемаяСтрока) Экспорт
	
	ТекЧтение = Новый ЧтениеJSON;
	ТекЧтение.УстановитьСтроку(ЧитаемаяСтрока);
	
	Возврат ТекЧтение;
	
КонецФункции

// Функция - Прочитать объект из потока
//
// Параметры:
//	Поток - объект чтения JSON, которых нужно прочитать.
//	ТипОбъекта - тип объекта для чтения.
// 
// Возвращаемое значение:
//	Произвольный - Результат чтения объекта.
//
Функция ПрочитатьОбъектИзПотока(Поток, ТипОбъекта) Экспорт
	
	Возврат ФабрикаXDTO.ПрочитатьJSON(Поток, ТипОбъекта);
	
КонецФункции

#КонецОбласти
