
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Отбор.Свойство("Ссылка") Тогда
		 
		Возврат;
			
	КонецЕсли;
	
	Если Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Системная
		ИЛИ Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Исходящая 
		ИЛИ Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Входящая Тогда
			
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОжиданиеОбработки);
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОбработкаОтменена);
		
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли Параметры.Отбор.Ссылка = Перечисления.сшпТипыОчередей.Отправки Тогда
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОжиданиеОтправки);
		ДанныеВыбора.Добавить(Перечисления.сшпСтатусыСообщений.ОтправкаОтменена);
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти